In [25]:
import pandas as pd
import numpy as np

In [4]:
titanic_Orginal= pd.read_csv("https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/titanic.csv")

In [5]:
titanic_Orginal.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Read in the titanic.csv file in the ~/data directory as a pandas dataframe called df**

In [10]:
titanic = pd.DataFrame(titanic_Orginal)

**Display the head of the dataframe**

In [11]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**What is the percentage of people who survived? (hint find the mean of the survival column)**

In [71]:
percentage_=titanic.Survived.mean()
percentage_

0.3838383838383838

**How many women and how many men survived?**

In [35]:
Count_menVSwomen=titanic.groupby('Sex').Survived.sum()
Count_menVSwomen   
# here I tried count, but I think it wrong cause it will count Zero's too , so thats why I used sum 
## cause Zero does not affect addition

Sex
female    233
male      109
Name: Survived, dtype: int64



**What is the percentage of people that survied who paid a fare less than 10?**

In [152]:
paid_less=titanic[titanic['Fare'] < 10].Survived.mean()
paid_less

0.19940476190476192

**What is the average age of those who didn't survive?**

In [154]:
dead_avg_age=titanic[titanic['Survived'] ==0].Age.mean()
dead_avg_age

30.62617924528302

**What is the average age of those who did survive?**

In [155]:
Survived_avg_age=titanic[titanic['Survived'] ==1].Age.mean()
Survived_avg_age

28.343689655172415

**What is the average age of those who did and didn't survive grouped by gender?**

In [158]:
Survived_OverView=titanic.groupby(['Sex', 'Survived']).Age.mean()
Survived_OverView

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64


**Tidy GDP**


Manipulate the GDP.csv file and make it tidy, the result should be a pandas dataframe with the following columns:


Country Name


Country Code

Year

GDP

In [3]:
GDP=pd.read_csv("https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/GDP.csv",skiprows=4)

In [4]:
GDP.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,Unnamed: 62
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,2.498933e+09,2.467704e+09,2.584464e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,...,1.248694e+10,1.593680e+10,1.793024e+10,2.053654e+10,2.026425e+10,2.061610e+10,1.921556e+10,1.946902e+10,2.081530e+10,NaN
2,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,7.549239e+10,8.252614e+10,1.041158e+11,1.139232e+11,1.249125e+11,1.267302e+11,1.026212e+11,9.533720e+10,1.242094e+11,NaN
3,Albania,ALB,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.204421e+10,1.192695e+10,1.289087e+10,1.231978e+10,1.277628e+10,1.322824e+10,1.138693e+10,1.188368e+10,1.303935e+10,NaN
4,Andorra,AND,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,3.660531e+09,3.355695e+09,3.442063e+09,3.164615e+09,3.281585e+09,3.350736e+09,2.811489e+09,2.877312e+09,3.012914e+09,NaN

In [ ]:
GDP['Indicator Name'].unique()
GDP['Indicator Code'].unique()
GDP['Unnamed: 62'].unique()

In [ ]:
GDP = GDP.drop(columns=['Indicator Name', 'Indicator Code', 'Unnamed: 62'])

In [5]:
#Assign the cloumns
cloumns = GDP.melt(id_vars=['Country Name', 'Country Code'], var_name='Year', value_name='GDP')
cloumns

       Country Name Country Code            Year                GDP
0             Aruba          ABW  Indicator Name  GDP (current US$)
1       Afghanistan          AFG  Indicator Name  GDP (current US$)
2            Angola          AGO  Indicator Name  GDP (current US$)
3           Albania          ALB  Indicator Name  GDP (current US$)
4           Andorra          AND  Indicator Name  GDP (current US$)
...             ...          ...             ...                ...
16099        Kosovo          XKX     Unnamed: 62                NaN
16100   Yemen, Rep.          YEM     Unnamed: 62                NaN
16101  South Africa          ZAF     Unnamed: 62                NaN
16102        Zambia          ZMB     Unnamed: 62                NaN
16103      Zimbabwe          ZWE     Unnamed: 62                NaN

[16104 rows x 4 columns]